In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,1,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,2,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,3,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,4,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,5,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...,...
882,883,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,884,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,885,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,886,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,887,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [10]:
len(df[df['Sex'] == 'female'])

314

In [17]:
df[(df['Sex'] == 'female') & (df['Survived'] == 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,2,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,3,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,4,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
8,9,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,10,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
...,...,...,...,...,...,...,...,...,...
870,871,1,2,Mrs. Samuel (Hannah Wizosky) Abelson,female,28.0,1,0,24.0000
871,872,1,3,Miss. Adele Kiamie Najib,female,15.0,0,0,7.2250
875,876,1,1,Mrs. Thomas Jr (Lily Alexenia Wilson) Potter,female,56.0,0,1,83.1583
876,877,1,2,Mrs. William (Imanita Parrish Hall) Shelley,female,25.0,0,1,26.0000
883,884,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000

In [22]:
# Count of females survived 

len(df[(df['Sex'] == 'female') & (df['Survived'] == 1)])

233

In [24]:
# Count of females survived 

df1 = df[(df['Sex'] == 'female') & (df['Survived'] == 1)]
df1.any(1).count()

233

In [27]:
# Count of females survived 

df1 = df[(df['Sex'] == 'female') & (df['Survived'] == 1)]
print(df1["PassengerId"].count())

233

In [30]:
# Count of females survived 

df[df["Survived"] == 1]['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [31]:
# Count of females survived. Selects the value in the location 'female'

df[df["Survived"] == 1]['Sex'].value_counts().loc['female']

233

In [32]:
# Count of females survived 

df[(df['Sex'] == 'female') & (df['Survived'] == 1)]['PassengerId'].count()

233

In [33]:
# Count of females survived 

df[(df['Sex'] == 'female') & (df['Survived'] == 1)]['Name'].count()

233

In [35]:
# Count of females survived using crosstab function

tab = pd.crosstab(df['Survived'],df['Sex'])
print(tab)

Sex       female  male
Survived
0             81   464
1            233   109